burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/*!
    \file    gd32w51x_f5hc_rcu.h
    \brief   definitions for the RCU

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32W51X_F5HC_RCU_H
#define GD32W51X_F5HC_RCU_H

#include "gd32w51x_f5hc.h"

/* RCU definitions */
#define RCU                             RCU_BASE

/* registers definitions */
#define RCU_CTL                         REG32(RCU + 0x00000000U)        /*!< control register */
#define RCU_PLL                         REG32(RCU + 0x00000004U)        /*!< PLL register */
#define RCU_CFG0                        REG32(RCU + 0x00000008U)        /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x0000000CU)        /*!< clock interrupt register */
#define RCU_AHB1RST                     REG32(RCU + 0x00000010U)        /*!< AHB1 reset register */
#define RCU_AHB2RST                     REG32(RCU + 0x00000014U)        /*!< AHB2 reset register */
#define RCU_AHB3RST                     REG32(RCU + 0x00000018U)        /*!< AHB3 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000020U)        /*!< APB1 reset register */
#define RCU_APB2RST                     REG32(RCU + 0x00000024U)        /*!< APB2 reset register */
#define RCU_AHB1EN                      REG32(RCU + 0x00000030U)        /*!< AHB1 enable register */
#define RCU_AHB2EN                      REG32(RCU + 0x00000034U)        /*!< AHB2 enable register */
#define RCU_AHB3EN                      REG32(RCU + 0x00000038U)        /*!< AHB3 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x00000040U)        /*!< APB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000044U)        /*!< APB2 enable register */
#define RCU_AHB1SPEN                    REG32(RCU + 0x00000050U)        /*!< AHB1 sleep mode enable register */
#define RCU_AHB2SPEN                    REG32(RCU + 0x00000054U)        /*!< AHB2 sleep mode enable register */
#define RCU_AHB3SPEN                    REG32(RCU + 0x00000058U)        /*!< AHB3 sleep mode enable register */
#define RCU_APB1SPEN                    REG32(RCU + 0x00000060U)        /*!< APB1 sleep mode enable register */
#define RCU_APB2SPEN                    REG32(RCU + 0x00000064U)        /*!< APB2 sleep mode enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000070U)        /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000074U)        /*!< reset source / clock register */
#define RCU_PLLSSCTL                    REG32(RCU + 0x00000080U)        /*!< PLL clock spread spectrum control register */
#define RCU_PLLCFG                      REG32(RCU + 0x00000084U)        /*!< PLL clock configuration register */
#define RCU_CFG1                        REG32(RCU + 0x0000008CU)        /*!< clock configuration register 1 */
#define RCU_ADDCTL                      REG32(RCU + 0x00000090U)        /*!< additional clock control register */
#define RCU_SECP_CFG                    REG32(RCU + 0x000000C0U)        /*!< secure configuration register */
#define RCU_SECP_STAT                   REG32(RCU + 0x000000C4U)        /*!< secure status register */
#define RCU_AHB1SECP_STAT               REG32(RCU + 0x000000C8U)        /*!< AHB1 secure status register */
#define RCU_AHB2SECP_STAT               REG32(RCU + 0x000000CCU)        /*!< AHB2 secure status register */
#define RCU_AHB3SECP_STAT               REG32(RCU + 0x000000D0U)        /*!< AHB3 secure status register */
#define RCU_APB1SECP_STAT               REG32(RCU + 0x000000D4U)        /*!< APB1 secure status register */
#define RCU_APB2SECP_STAT               REG32(RCU + 0x000000D8U)        /*!< APB2 secure status register */
#if defined (GD32W515)
#define RCU_VKEY                        REG32(RCU + 0x00000100U)        /*!< voltage key register */
#define RCU_DSV                         REG32(RCU + 0x00000134U)        /*!< deep-sleep mode voltage register */
#endif /* GD32W515 */

/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC16MEN                BIT(0)                    /*!< internal high speed oscillator enable */
#define RCU_CTL_IRC16MSTB               BIT(1)                    /*!< IRC16M high speed internal oscillator stabilization flag */
#define RCU_CTL_RCUPRIP                 BIT(2)                    /*!< privilege protection */
#define RCU_CTL_IRC16MADJ               BITS(3,7)                 /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL_IRC16MCALIB             BITS(8,15)                /*!< high speed internal oscillator calibration value register */
#define RCU_CTL_HXTALEN                 BIT(16)                   /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                   /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                   /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                   /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLLEN                   BIT(24)                   /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                   /*!< PLL clock stabilization flag */
#define RCU_CTL_PLLI2SEN                BIT(26)                   /*!< PLLI2S enable */
#define RCU_CTL_PLLI2SSTB               BIT(27)                   /*!< PLLI2S clock stabilization flag */
#if defined (GD32F5HC)
#define RCU_CTL_HXTALRDYRST             BIT(20)                   /*!< HXTAL ready reset */
#define RCU_CTL_IRC48MEN                BIT(28)                   /*!< Internal 48MHz RC oscillator enable */
#define RCU_CTL_IRC48MSTB               BIT(29)                   /*!< Internal 48MHz RC oscillator clock stabilization Flag */
#else
#define RCU_CTL_PLLDIGPU                BIT(20)                   /*!< PLLDIG power up */
#define RCU_CTL_PLLDIGEN                BIT(21)                   /*!< PLLDIG enable */
#define RCU_CTL_RFCKMEN                 BIT(22)                   /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLLDIGSTB               BIT(23)                   /*!< PLLDIG clock stabilization flag */
#define RCU_CTL_HXTALPU                 BIT(28)                   /*!< high speed crystal oscillator (HXTAL) power up */
#define RCU_CTL_HXTALENI2S              BIT(29)                   /*!< high speed crystal oscillator enable for PLLI2S */
#define RCU_CTL_HXTALENPLL              BIT(30)                   /*!< high speed crystal oscillator enable for system PLLsys */
#define RCU_CTL_HXTALREADY              BIT(31)                   /*!< high speed crystal oscillator ready set by software */
#endif /* GD32F5HC */

