burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* RCU_PLLCFG */
#define RCU_PLLCFG_PLLI2SDIV            BITS(0,5)                 /*!< PLLI2S clock divider factor */
#define RCU_PLLCFG_PLLI2SN              BITS(8,14)                /*!< the PLLI2S VCO clock multiplication factor */
#define RCU_PLLCFG_PLLI2SPSC            BITS(16,18)               /*!< the PLLI2S VCO source clock pre-scale */
#if defined (GD32W515)
#define RCU_PLLCFG_PLLDIGOSEL           BITS(24,25)               /*!< PLLDIG output frequency select */
#define RCU_PLLCFG_PLLDIGDIV_SYS        BITS(26,31)               /*!< PLLDIG clock divider factor for system clock */
#endif /* defined(GD32W515) */
/* RCU_CFG1 */
#define RCU_CFG1_IRC16MDIV              BITS(0,8)                 /*!< IRC16M clock divider factor for system clock */
#if defined (GD32W515)
#define RCU_CFG1_BGVBIT                 BITS(9,11)                /*!< bandGap power adjust */
#define RCU_CFG1_RFPLLCALEN             BIT(14)                   /*!< RF PLL Calculation enable */
#define RCU_CFG1_RFPLLLOCK              BIT(15)                   /*!< RF PLL LOCK */
#define RCU_CFG1_RFPLLPU                BIT(16)                   /*!< RFPLL power on enable */
#define RCU_CFG1_LDOANAPU               BIT(17)                   /*!< LDO analog power on enable for RF filter */
#define RCU_CFG1_LDOCLKPU               BIT(18)                   /*!< LDO clock power on enable for RF/ADC/DAC */
#define RCU_CFG1_BGPU                   BIT(19)                   /*!< bandGap power on enable */
#define RCU_CFG1_LDO_CLK_LQB            BIT(20)                   /*!< trust zone security by RF */
#define RCU_CFG1_LDO_ANA_LQB            BIT(21)                   /*!< trust zone security by RF */
#endif /* defined(GD32W515) */
#if defined (GD32F5HC)
#define RCU_CFG1_I2C1SEL                BITS(22,23)               /*!< I2C1 clock Source Selection */
#endif /* GD32F5HC */
#define RCU_CFG1_TIMERSEL               BIT(24)                   /*!< TIMER clock selection */
#define RCU_CFG1_I2C0SEL                BITS(26,27)               /*!< I2C0 Clock Source Selection */
#define RCU_CFG1_USART2SEL              BITS(28,29)               /*!< USART2 Clock Source Selection */
#define RCU_CFG1_USART0SEL              BITS(30,31)               /*!< USART0 Clock Source Selection */


/* RCU_ADDCTL */
#define RCU_ADDCTL_USBFSSEL             BIT(0)                    /*!< USBFS clock selection */
#define RCU_ADDCTL_USBFSDIV             BITS(1,5)                 /*!< USBFS clock divider factor */
#if defined (GD32W515)
#define RCU_ADDCTL_HPDFSEL              BIT(11)                   /*!< HPDF clock source selection */
#endif /* defined (GD32W515) */
#define RCU_ADDCTL_I2SSEL               BITS(12,13)               /*!< I2S clock source selection */
#if defined (GD32W515)
#define RCU_ADDCTL_HPDFAUDIOSEL         BITS(14,15)               /*!< HPDF AUDIO clock source selection */
#endif /* defined (GD32W515) */
#if defined (GD32W515)
#define RCU_ADDCTL_SDIOSEL_0            BIT(16)                   /*!< SDIO clock selection */
#define RCU_ADDCTL_SDIODIV              BITS(17,21)               /*!< SDIO clock divider factor */
#define RCU_ADDCTL_SDIOSEL_1            BIT(22)                   /*!< SDIO clock selection */
#endif /* defined(GD32W515) */
#define RCU_ADDCTL_PLLDIV_I2S           BITS(24,29)               /*!< the PLL divider factor for I2S clock */

/* RCU_SECP_CFG */
#define RCU_SECP_CFG_IRC16MSECP            BIT(0)                 /*!< IRC16M clock configuration and status bits security */
#define RCU_SECP_CFG_HXTALSECP             BIT(1)                 /*!< HXTAL clock configuration and status bits security */
#define RCU_SECP_CFG_IRC32KSECP            BIT(2)                 /*!< IRC32K clock configuration and status bits security */
#define RCU_SECP_CFG_LXTALSECP             BIT(3)                 /*!< LXTAL clock configuration and status bits security */
#define RCU_SECP_CFG_SYSCLKSECP            BIT(4)                 /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
#define RCU_SECP_CFG_PRESCSECP             BIT(5)                 /*!< AHBx/APBx prescaler configuration bits security */
#define RCU_SECP_CFG_PLLSECP               BIT(6)                 /*!< main PLL configuration and status bits security */
#if defined (GD32W515)
#define RCU_SECP_CFG_PLLDIGSECP            BIT(7)                 /*!< PLLDIG configuration and status bits security */
#endif /* GD32W515 */
#define RCU_SECP_CFG_PLLI2SSECP            BIT(8)                 /*!< PLLI2S configuration and status bits security */
#define RCU_SECP_CFG_RMVRSTFSECP           BIT(9)                 /*!< remove reset flag security */
#define RCU_SECP_CFG_BKPSECP               BIT(10)                /*!< BKP security */
#if defined (GD32F5HC)
#define RCU_SECP_CFG_IRC48MSECP            BIT(12)                /*!< IRC48M security */
#endif /* GD32F5HC */

/* RCU_SECP_STAT */
#define RCU_SECP_STAT_IRC16MSECF          BIT(0)                  /*!< IRC16M clock configuration and status bits security flag */
#define RCU_SECP_STAT_HXTALSECF           BIT(1)                  /*!< HXTAL clock configuration and status bits security flag */
#define RCU_SECP_STAT_IRC32KSECF          BIT(2)                  /*!< IRC32K clock configuration and status bits security flag */
#define RCU_SECP_STAT_LXTALSECF           BIT(3)                  /*!< LXTAL clock configuration and status bits security flag */
#define RCU_SECP_STAT_SYSCLKSECF          BIT(4)                  /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
#define RCU_SECP_STAT_PRESCSECF           BIT(5)                  /*!< AHBx/APBx prescaler configuration bits security flag */
#define RCU_SECP_STAT_PLLSECF             BIT(6)                  /*!< main PLL configuration and status bits security flag */
#if defined (GD32W515)
#define RCU_SECP_STAT_PLLDIGSECF          BIT(7)                  /*!< PLLDIG configuration and status bits security flag */
#endif /* GD32W515 */
#define RCU_SECP_STAT_PLLI2SSECF          BIT(8)                  /*!< PLLI2S configuration and status bits security flag */
#define RCU_SECP_STAT_RMVRSTFSECF         BIT(9)                  /*!< remove reset flag security flag */
#define RCU_SECP_STAT_BKPSECF             BIT(10)                 /*!< BKP security flag */
#if defined (GD32F5HC)
#define RCU_SECP_STAT_IRC48MSECF          BIT(12)                 /*!< IRC48M configuration and status bits security flag */
#endif /* GD32F5HC */

/* RCU_AHB1SECP_STAT */
#define RCU_AHB1SECP_STAT_PASECF          BIT(0)                  /*!< GPIO port A security flag */
#define RCU_AHB1SECP_STAT_PBSECF          BIT(1)                  /*!< GPIO port B security flag */
#define RCU_AHB1SECP_STAT_PCSECF          BIT(2)                  /*!< GPIO port C security flag */
#define RCU_AHB1SECP_STAT_PDSECF          BIT(3)                  /*!< GPIO port D security flag */
#define RCU_AHB1SECP_STAT_GTZCSECF        BIT(7)                  /*!< GTZC security flag */
#define RCU_AHB1SECP_STAT_CRCSECF         BIT(12)                 /*!< CRC security flag */
#if defined (GD32W515)
#define RCU_AHB1SECP_STAT_WIFISECF        BIT(13)                 /*!< WIFI security flag */
#endif /* GD32W515 */
#define RCU_AHB1SECP_STAT_FLITFSECF       BIT(15)                 /*!< FLITF security flag */
#define RCU_AHB1SECP_STAT_SRAM0SECF       BIT(16)                 /*!< SRAM0 security flag */
#define RCU_AHB1SECP_STAT_SRAM1SECF       BIT(17)                 /*!< SRAM1 security flag */
#define RCU_AHB1SECP_STAT_SRAM2SECF       BIT(18)                 /*!< SRAM2 security flag */
#define RCU_AHB1SECP_STAT_SRAM3SECF       BIT(19)                 /*!< SRAM3 security flag */
#define RCU_AHB1SECP_STAT_DMA0SECF        BIT(21)                 /*!< DMA0 security flag */
#define RCU_AHB1SECP_STAT_DMA1SECF        BIT(22)                 /*!< DMA1 security flag */
#define RCU_AHB1SECP_STAT_USBFSSECF       BIT(29)                 /*!< USBFS security flag */

/* RCU_AHB2SECP_STAT */
#if defined (GD32W515)
#define RCU_AHB2SECP_STAT_DCISECF         BIT(0)                  /*!< DCI security flag */
#endif /* defined (GD32W515) */
#define RCU_AHB2SECP_STAT_PKCAUSECF       BIT(3)                  /*!< PKCAU security flag */
#define RCU_AHB2SECP_STAT_CAUSECF         BIT(4)                  /*!< CAU security flag */
#define RCU_AHB2SECP_STAT_HAUSECF         BIT(5)                  /*!< HAU security flag */
#define RCU_AHB2SECP_STAT_TRNGSECF        BIT(6)                  /*!< TRNG security flag */

/* RCU_AHB3SECP_STAT */
#define RCU_AHB3SECP_STAT_SQPISECF        BIT(0)                  /*!< SQPI security flag */
#define RCU_AHB3SECP_STAT_QSPISECF        BIT(1)                  /*!< QSPI security flag */

/* RCU_APB1SECP_STAT */
#define RCU_APB1SECP_STAT_TIMER1SECF      BIT(0)                  /*!< TIMER1 security flag */
#define RCU_APB1SECP_STAT_TIMER2SECF      BIT(1)                  /*!< TIMER2 security flag */
#define RCU_APB1SECP_STAT_TIMER3SECF      BIT(2)                  /*!< TIMER3 security flag */
#define RCU_APB1SECP_STAT_TIMER4SECF      BIT(3)                  /*!< TIMER4 security flag */
#define RCU_APB1SECP_STAT_TIMER5SECF      BIT(4)                  /*!< TIMER5 security flag */
#define RCU_APB1SECP_STAT_WWDGTSECF       BIT(11)                 /*!< WWDGT security flag */
#define RCU_APB1SECP_STAT_SPI1SECF        BIT(14)                 /*!< SPI1 security flag */
#define RCU_APB1SECP_STAT_USART1SECF      BIT(17)                 /*!< USART1 security flag */
#define RCU_APB1SECP_STAT_USART0SECF      BIT(18)                 /*!< USART0 security flag */
#define RCU_APB1SECP_STAT_I2C0SECF        BIT(21)                 /*!< I2C0 security flag */
#define RCU_APB1SECP_STAT_I2C1SECF        BIT(22)                 /*!< I2C1 security flag */
#define RCU_APB1SECP_STAT_CTCSECF         BIT(27)                 /*!< CTC security flag */
#define RCU_APB1SECP_STAT_PMUSECF         BIT(28)                 /*!< PMU security flag */

/* RCU_APB2SECP_STAT */
#define RCU_APB2SECP_STAT_TIMER0SECF      BIT(0)                  /*!< TIMER0 security flag */
#define RCU_APB2SECP_STAT_USART2SECF      BIT(4)                  /*!< USART2 security flag */
#define RCU_APB2SECP_STAT_ADCSECF         BIT(8)                  /*!< ADC security flag */
#if defined (GD32W515)
#define RCU_APB2SECP_STAT_SDIOSECF        BIT(11)                 /*!< SDIO security flag */
#endif /* GD32W515 */
#define RCU_APB2SECP_STAT_SPI0SECF        BIT(12)                 /*!< SPI0 security flag */
#define RCU_APB2SECP_STAT_SYSCFGSECF      BIT(14)                 /*!< SYSCFG security flag */
#define RCU_APB2SECP_STAT_TIMER15SECF     BIT(17)                 /*!< TIMER15 security flag */
#define RCU_APB2SECP_STAT_TIMER16SECF     BIT(18)                 /*!< TIMER16 security flag */
#if defined (GD32W515)
#define RCU_APB2SECP_STAT_HPDFSECF        BIT(30)                 /*!< HPDF security flag */
#endif /* defined (GD32W515) */
#if defined (GD32W515)
#define RCU_APB2SECP_STAT_RFSECF          BIT(31)                 /*!< RF security flag */
#endif /* GD32W515 */


