burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* peripheral clock enable */
typedef enum
{

    /* AHB1 peripherals */
    RCU_GPIOA     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 0U),                  /*!< GPIOA clock */
    RCU_GPIOB     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 1U),                  /*!< GPIOB clock */
    RCU_GPIOC     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 2U),                  /*!< GPIOC clock */
#if defined (GD32F5HC)
    RCU_GPIOD     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 3U),                  /*!< GPIOD clock */
#endif /* GD32F5HC */
    RCU_TZPCU     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 7U),                  /*!< TZPCU clock */
#if defined (GD32W515)
    RCU_TSI       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 8U),                  /*!< TSI clock */
    RCU_WIFI      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 13U),                 /*!< WIFI clock */
    RCU_WIFIRUN   = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 14U),                 /*!< WIFIRUN clock */
#endif /* GD32W515 */
    RCU_CRC       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 12U),                 /*!< CRC clock */
    RCU_SRAM0     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 16U),                 /*!< SRAM0 clock */
    RCU_SRAM1     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 17U),                 /*!< SRAM1 clock */
    RCU_SRAM2     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 18U),                 /*!< SRAM2 clock */
    RCU_SRAM3     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 19U),                 /*!< SRAM3 clock */
    RCU_DMA0      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 21U),                 /*!< DMA0 clock */
    RCU_DMA1      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 22U),                 /*!< DMA1 clock */
    RCU_USBFS     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 29U),                 /*!< USBFS clock */

    /* AHB2 peripherals */
#if defined (GD32W515)
    RCU_DCI       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 0U),                  /*!< DCI clock */
#endif /* defined (GD32W515) */
    RCU_PKCAU     = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 3U),                  /*!< PKCAU clock */
    RCU_CAU       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 4U),                  /*!< CAU clock */
    RCU_HAU       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 5U),                  /*!< HAU clock */
    RCU_TRNG      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 6U),                  /*!< TRNG clock */
    /* AHB3 peripherals */
    RCU_SQPI      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 0U),                  /*!< SQPI clock */
    RCU_QSPI      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 1U),                  /*!< QSPI clock */
    /* APB1 peripherals */
    RCU_TIMER1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                  /*!< TIMER1 clock */
    RCU_TIMER2    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),                  /*!< TIMER2 clock */
    RCU_TIMER3    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 2U),                  /*!< TIMER3 clock */
    RCU_TIMER4    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 3U),                  /*!< TIMER4 clock */
    RCU_TIMER5    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                  /*!< TIMER5 clock */
    RCU_WWDGT     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                 /*!< WWDGT clock */
    RCU_SPI1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                 /*!< SPI1 clock */
    RCU_USART1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                 /*!< USART1 clock */
    RCU_USART0    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                 /*!< USART0 clock */
    RCU_I2C0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                 /*!< I2C0 clock */
    RCU_I2C1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                 /*!< I2C1 clock */
#if defined (GD32F5HC)
    RCU_CTC       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 27U),                 /*!< CTC clock */
#endif /* GD32F5HC */
    RCU_PMU       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                 /*!< PMU clock */
    RCU_RTC       = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 15U),                  /*!< RTC clock */
    /* APB2 peripherals */
    RCU_TIMER0    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),                  /*!< TIMER0 clock */
    RCU_USART2    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 4U),                  /*!< USART2 clock */
    RCU_ADC       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 8U),                  /*!< ADC clock */
#if defined (GD32W515)
    RCU_SDIO      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 11U),                 /*!< SDIO clock */
#endif /* defined (GD32W515) */
    RCU_SPI0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),                 /*!< SPI0 clock */
    RCU_SYSCFG    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 14U),                 /*!< SYSCFG clock */
    RCU_TIMER15   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 17U),                 /*!< TIMER15 clock */
    RCU_TIMER16   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 18U),                 /*!< TIMER16 clock */
#if defined (GD32W515)
    RCU_HPDF      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 30U),                 /*!< HPDF clock */
    RCU_RF        = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 31U)                  /*!< RF clock */
#endif /* GD32W515 */
}rcu_periph_enum;

/* peripheral clock enable when sleep mode*/
typedef enum
{
    /* AHB1 peripherals */
    RCU_GPIOA_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 0U),            /*!< GPIOA clock when sleep mode */
    RCU_GPIOB_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 1U),            /*!< GPIOB clock when sleep mode */
    RCU_GPIOC_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 2U),            /*!< GPIOC clock when sleep mode */
#if defined (GD32F5HC)
    RCU_GPIOD_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 3U),            /*!< GPIOD clock when sleep mode */
#endif /* GD32F5HC */
    RCU_TZPCU_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 7U),            /*!< TZPCU clock when sleep mode */
    RCU_CRC_SLP       = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 12U),           /*!< CRC clock when sleep mode */
#if defined (GD32W515)
    RCU_TSI_SLP       = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 8U),            /*!< TSI clock when sleep mode */
    RCU_WIFI_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 13U),           /*!< WIFI clock when sleep mode */
    RCU_WIFIRUN_SLP   = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 14U),           /*!< WIFIRUN clock when sleep mode */
#endif /* GD32W515 */
    RCU_FMC_SLP       = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 15U),           /*!< FMC clock when sleep mode*/
    RCU_SRAM0_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 16U),           /*!< SRAM0 clock when sleep mode */
    RCU_SRAM1_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 17U),           /*!< SRAM1 clock when sleep mode */
    RCU_SRAM2_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 18U),           /*!< SRAM2 clock when sleep mode*/
    RCU_SRAM3_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 19U),           /*!< SRAM3 clock when sleep mode */
    RCU_DMA0_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 21U),           /*!< DMA0 clock when sleep mode */
    RCU_DMA1_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 22U),           /*!< DMA1 clock when sleep mode */
    RCU_USBFS_SLP     = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 29U),           /*!< USBFS clock when sleep mode */
    /* AHB2 peripherals */
#if defined (GD32W515)
    RCU_DCI_SLP       = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 0U),            /*!< DCI clock when sleep mode */
#endif /* defined (GD32W515) */
    RCU_PKCAU_SLP     = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 3U),            /*!< PKCAU clock when sleep mode*/
    RCU_CAU_SLP       = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 4U),            /*!< CAU clock when sleep mode */
    RCU_HAU_SLP       = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 5U),            /*!< HAU clock when sleep mode */
    RCU_TRNG_SLP      = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 6U),            /*!< TRNG clock when sleep mode */
    /* AHB3 peripherals */
    RCU_SQPI_SLP      = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 0U),            /*!< SQPI clock when sleep mode */
    RCU_QSPI_SLP      = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 1U),            /*!< QSPI clock when sleep mode */
    /* APB1 peripherals */
    RCU_TIMER1_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 0U),            /*!< TIMER1 clock when sleep mode */
    RCU_TIMER2_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 1U),            /*!< TIMER2 clock when sleep mode */
    RCU_TIMER3_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 2U),            /*!< TIMER3 clock when sleep mode */
    RCU_TIMER4_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 3U),            /*!< TIMER4 clock when sleep mode*/
    RCU_TIMER5_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 4U),            /*!< TIMER5 clock when sleep mode */
    RCU_WWDGT_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 11U),           /*!< WWDGT clock when sleep mode */
    RCU_SPI1_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 14U),           /*!< SPI1 clock when sleep mode */
    RCU_USART1_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 17U),           /*!< USART1 clock when sleep mode */
    RCU_USART0_SLP    = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 18U),           /*!< USART0 clock when sleep mode*/
    RCU_I2C0_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 21U),           /*!< I2C0 clock when sleep mode */
    RCU_I2C1_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 22U),           /*!< I2C1 clock when sleep mode */
#if defined(GD32F5HC)
    RCU_CTC_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 27U),           /*!< CTC clock when sleep mode */
#endif /* GD32F5HC */
    RCU_PMU_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 28U),           /*!< PMU clock when sleep mode */
    /* APB2 peripherals */
    RCU_TIMER0_SLP    = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 0U),            /*!< TIMER0 clock when sleep mode */
    RCU_USART2_SLP    = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 4U),            /*!< USART2 clock when sleep mode */
    RCU_ADC_SLP       = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 8U),            /*!< ADC clock when sleep mode */
#if defined (GD32W515)
    RCU_SDIO_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 11U),           /*!< SDIO clock when sleep mode */
#endif /* GD32W515 */
    RCU_SPI0_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 12U),           /*!< SPI0 clock when sleep mode */
    RCU_SYSCFG_SLP    = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 14U),           /*!< SYSCFG clock when sleep mode */
    RCU_TIMER15_SLP   = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 17U),           /*!< TIMER15 clock when sleep mode*/
    RCU_TIMER16_SLP   = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 18U),           /*!< TIMER16 clock when sleep mode */
#if defined (GD32W515)
    RCU_HPDF_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 30U),           /*!< HPDF clock when sleep mode */
#endif /* defined (GD32W515) */
#if defined (GD32W515)
    RCU_RF_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 31U)            /*!< RF clock when sleep mode */
#endif
}rcu_periph_sleep_enum;

/* clock stabilization and peripheral reset flags */
typedef enum
{
    /* clock stabilization flags */
    RCU_FLAG_IRC16MSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 1U),            /*!< IRC16M stabilization flags */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),           /*!< HXTAL stabilization flags */
#if defined (GD32W515)
    RCU_FLAG_PLLDIGSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 23U),           /*!< PLLDIG stabilization flags */
#endif /* GD32W515 */
    RCU_FLAG_PLLSTB        = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),           /*!< PLL stabilization flags */
    RCU_FLAG_PLLI2SSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 27U),           /*!< PLLI2S stabilization flags */
#if defined (GD32F5HC)
    RCU_FLAG_IRC48MSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 29U),           /*!< IRC48M stabilization flags */
#endif /* GD32F5HC */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),          /*!< LXTAL stabilization flags */
    RCU_FLAG_IRC32KSTB     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),         /*!< IRC32K stabilization flags */
    /* reset source flags */
    RCU_FLAG_OBLRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),        /*!< option byte loader reset flag */
    RCU_FLAG_EPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),        /*!< external PIN reset flags */
    RCU_FLAG_PORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),        /*!< power reset flags */
    RCU_FLAG_SWRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),        /*!< software reset flags */
    RCU_FLAG_FWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),        /*!< FWDGT reset flags */
    RCU_FLAG_WWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),        /*!< WWDGT reset flags */
    RCU_FLAG_LPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U)         /*!< low-power reset flags */
}rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum
{
    RCU_INT_FLAG_IRC32KSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),            /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),            /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC16MSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),            /*!< IRC16M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),            /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLLSTB    = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),            /*!< PLL stabilization interrupt flag */
    RCU_INT_FLAG_PLLI2SSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 5U),            /*!< PLLI2S stabilization interrupt flag */
#if defined (GD32W515)
    RCU_INT_FLAG_PLLDIGSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),            /*!< PLLDIG stabilization interrupt flag */
#endif /* GD32W515 */
    RCU_INT_FLAG_CKM       = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),            /*!< HXTAL clock stuck interrupt flag */
#if defined (GD32F5HC)
    RCU_INT_FLAG_IRC48MSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 25U),          /*!< IRC48M stabilization interrupt flag */
    RCU_INT_FLAG_LXTALCKMIF  = RCU_REGIDX_BIT(INT_REG_OFFSET, 31U)          /*!< LXTAL clock stuck interrupt flag */
#endif /* GD32F5HC */
}rcu_int_flag_enum;

