burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* clock stabilization and stuck interrupt flags clear */
typedef enum
{
    RCU_INT_FLAG_IRC32KSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 16U),       /*!< IRC32K stabilization interrupt flags clear */
    RCU_INT_FLAG_LXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 17U),       /*!< LXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_IRC16MSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 18U),       /*!< IRC16M stabilization interrupt flags clear */
    RCU_INT_FLAG_HXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 19U),       /*!< HXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_PLLSTB_CLR    = RCU_REGIDX_BIT(INT_REG_OFFSET, 20U),       /*!< PLL stabilization interrupt flags clear */
    RCU_INT_FLAG_PLLI2SSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 21U),       /*!< PLLI2S stabilization interrupt flags clear */
#if defined (GD32W515)
    RCU_INT_FLAG_PLLDIGSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 22U),       /*!< PLLDIG stabilization interrupt flags clear */
#endif /* GD32W515 */
    RCU_INT_FLAG_CKM_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 23U),       /*!< CKM interrupt flags clear */
#if defined (GD32F5HC)
    RCU_INT_FLAG_LXTALCKMIF_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 24U),      /*!< LXTAL clock stuck interrupt clear */
    RCU_INT_FLAG_IRC48MSTB_CLR   = RCU_REGIDX_BIT(INT_REG_OFFSET, 27U),     /*!< IRC48M stabilization interrupt flag */
#endif /* GD32F5HC */
}rcu_int_flag_clear_enum;

/* clock stabilization interrupt enable or disable */
typedef enum
{
    RCU_INT_IRC32KSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 8U),           /*!< IRC32K stabilization interrupt */
    RCU_INT_LXTALSTB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 9U),           /*!< LXTAL stabilization interrupt */
    RCU_INT_IRC16MSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 10U),          /*!< IRC16M stabilization interrupt */
    RCU_INT_HXTALSTB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 11U),          /*!< HXTAL stabilization interrupt */
    RCU_INT_PLLSTB          = RCU_REGIDX_BIT(INT_REG_OFFSET, 12U),          /*!< PLL stabilization interrupt */
    RCU_INT_PLLI2SSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 13U),          /*!< PLLI2S stabilization interrupt */
#if defined (GD32W515)
    RCU_INT_PLLDIGSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 14U),          /*!< PLLDIG stabilization interrupt */
#endif /* GD32W515 */
#if defined (GD32F5HC)
    RCU_INT_IRC48MSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 26U),          /*!< IRC48M stabilization interrupt */
#endif /* GD32F5HC */
}rcu_int_enum;

#if defined (GD32W515)
typedef enum
{
    RCU_UNIT_HXTAL         = RCU_REGIDX_BIT(CTL_REG_OFFSET, 28U),           /*!< HXTAL */
    RCU_UNIT_PLLDIG        = RCU_REGIDX_BIT(CTL_REG_OFFSET, 20U),           /*!< PLLDIG */
    RCU_UNIT_RFPLL         = RCU_REGIDX_BIT(CFG1_REG_OFFSET, 16U),          /*!< RFPLL */
    RCU_UNIT_LDOANA        = RCU_REGIDX_BIT(CFG1_REG_OFFSET, 17U),          /*!< LDOANA */
    RCU_UNIT_LDOCLK        = RCU_REGIDX_BIT(CFG1_REG_OFFSET, 18U),          /*!< LDOCLK */
    RCU_UNIT_BANDGAP       = RCU_REGIDX_BIT(CFG1_REG_OFFSET, 19U)           /*!< BANDGAP */
}rcu_unit_enum;
#endif /* GD32W515 */

/* oscillator types */
typedef enum
{
    RCU_HXTAL      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 16U),                   /*!< HXTAL */
    RCU_LXTAL      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 0U),                  /*!< LXTAL */
    RCU_IRC16M     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 0U),                    /*!< IRC16M */
#if defined (GD32F5HC)
    RCU_IRC48M     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 28U),                   /*!< IRC48M */
#endif /* GD32F5HC */
    RCU_IRC32K     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 0U),                 /*!< IRC32K */
#if defined (GD32W515)
    RCU_PLLDIG_CK  = RCU_REGIDX_BIT(CTL_REG_OFFSET, 21U),                   /*!< PLLDIG */
#endif /* GD32W515 */
    RCU_PLL_CK     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 24U),                   /*!< PLL */
    RCU_PLLI2S_CK  = RCU_REGIDX_BIT(CTL_REG_OFFSET, 26U)                    /*!< PLLI2S */
}rcu_osci_type_enum;

/* rcu clock frequency */
typedef enum
{
    CK_SYS      = 0,                                                        /*!< system clock */
    CK_AHB,                                                                 /*!< AHB clock */
    CK_APB1,                                                                /*!< APB1 clock */
    CK_APB2,                                                                /*!< APB2 clock */
    CK_USART0,                                                              /*!< USART0 clock */
    CK_USART2,                                                              /*!< USART2 clock */
    CK_I2C0,                                                                /*!< I2C0 clock */
#if defined (GD32F5HC)
    CK_I2C1                                                                 /*!< I2C1 clock */
#endif /* GD32F5HC */
}rcu_clock_freq_enum;

/* clock security attribution enable or disable */
typedef enum
{
    RCU_SEC_IRC16MSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 0U),        /*!< IRC16M clock configuration and status bits security */
    RCU_SEC_HXTALSEC        = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 1U),        /*!< HXTAL clock configuration and status bits security */
    RCU_SEC_IRC32KSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 2U),        /*!< IRC32K clock configuration and status bits security */
    RCU_SEC_LXTALSEC        = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 3U),        /*!< LXTAL clock configuration and status bits security */
    RCU_SEC_SYSCLKSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 4U),        /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
    RCU_SEC_PRESCSEC        = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 5U),        /*!< AHBx/APBx prescaler configuration bits security */
    RCU_SEC_PLLSEC          = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 6U),        /*!< main PLL configuration and status bits security */
#if defined (GD32W515)
    RCU_SEC_PLLDIGSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 7U),        /*!< PLLDIG configuration and status bits security */
#endif /* GD32W515 */
    RCU_SEC_PLLI2SSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 8U),        /*!< PLLI2S configuration and status bits security */
    RCU_SEC_RMVRSTFSEC      = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 9U),        /*!< remove reset flag security */
    RCU_SEC_BKPSEC          = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 10U),       /*!< BKP security */
#if defined (GD32F5HC)
    RCU_SEC_IRC48MSEC       = RCU_REGIDX_BIT(SECPCFG_REG_OFFSET, 12U),       /*!< IRC48M clock configuration and status bits security */
#endif /* GD32F5HC */
}rcu_sec_enum;

