burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* clock security status flag */
typedef enum
{
    RCU_SEC_FLAG_IRC16MSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 0U),  /*!< IRC16M clock configuration and status bits security */
    RCU_SEC_FLAG_HXTALSEC        = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 1U),  /*!< HXTAL clock configuration and status bits security */
    RCU_SEC_FLAG_IRC32KSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 2U),  /*!< IRC32K clock configuration and status bits security */
    RCU_SEC_FLAG_LXTALSEC        = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 3U),  /*!< LXTAL clock configuration and status bits security */
    RCU_SEC_FLAG_SYSCLKSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 4U),  /*!< SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration */
    RCU_SEC_FLAG_PRESCSEC        = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 5U),  /*!< AHBx/APBx prescaler configuration bits security */
    RCU_SEC_FLAG_PLLSEC          = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 6U),  /*!< main PLL configuration and status bits security */
#if defined (GD32W515)
    RCU_SEC_FLAG_PLLDIGSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 7U),  /*!< PLLDIG configuration and status bits security */
#endif /* GD32W515 */
    RCU_SEC_FLAG_PLLI2SSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 8U),  /*!< PLLI2S configuration and status bits security */
    RCU_SEC_FLAG_RMVRSTFSEC      = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 9U),  /*!< remove reset flag security */
    RCU_SEC_FLAG_BKPSEC          = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 10U), /*!< BKP security */
#if defined (GD32F5HC)
    RCU_SEC_FLAG_IRC48MSEC       = RCU_REGIDX_BIT(SECPSTAT_REG_OFFSET, 12U), /*!< IRC48M clock configuration and status bits security */
#endif /* GD32F5HC */
    /* AHB1 peripherals */
    RCU_SEC_FLAG_GPIOA     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 0U),    /*!< GPIOA clock */
    RCU_SEC_FLAG_GPIOB     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 1U),    /*!< GPIOB clock */
    RCU_SEC_FLAG_GPIOC     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 2U),    /*!< GPIOC clock */
#if defined (GD32F5HC)
    RCU_SEC_FLAG_GPIOD     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 3U),    /*!< GPIOD clock */
#endif /* GD32F5HC */
    RCU_SEC_FLAG_GTZC      = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 7U),    /*!< GTZC clock */
    RCU_SEC_FLAG_CRC       = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 12U),   /*!< CRC clock */
#if defined (GD32W515)
    RCU_SEC_FLAG_WIFI      = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 13U),   /*!< WIFI clock */
#endif /* GD32W515 */
    RCU_SEC_FLAG_FMC       = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 15U),   /*!< FMC clock */
    RCU_SEC_FLAG_SRAM0     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 16U),   /*!< SRAM0 clock */
    RCU_SEC_FLAG_SRAM1     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 17U),   /*!< SRAM1 clock */
    RCU_SEC_FLAG_SRAM2     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 18U),   /*!< SRAM2 clock */
    RCU_SEC_FLAG_SRAM3     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 19U),   /*!< SRAM3 clock */
    RCU_SEC_FLAG_DMA0      = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 21U),   /*!< DMA0 clock */
    RCU_SEC_FLAG_DMA1      = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 22U),   /*!< DMA1 clock */
    RCU_SEC_FLAG_USBFS     = RCU_REGIDX_BIT(AHB1SECPSTAT_REG_OFFSET, 29U),   /*!< USBFS clock */
    /* AHB2 peripherals */
#if defined (GD32W515)
    RCU_SEC_FLAG_DCI       = RCU_REGIDX_BIT(AHB2SECPSTAT_REG_OFFSET, 0U),    /*!< DCI clock */
#endif /* defined (GD32W515) */
    RCU_SEC_FLAG_PKCAU       = RCU_REGIDX_BIT(AHB2SECPSTAT_REG_OFFSET, 3U),  /*!< PKCAU clock */
    RCU_SEC_FLAG_CAU      = RCU_REGIDX_BIT(AHB2SECPSTAT_REG_OFFSET, 4U),     /*!< CAU clock */
    RCU_SEC_FLAG_HAU      = RCU_REGIDX_BIT(AHB2SECPSTAT_REG_OFFSET, 5U),     /*!< HAU clock */
    RCU_SEC_FLAG_TRNG      = RCU_REGIDX_BIT(AHB2SECPSTAT_REG_OFFSET, 6U),    /*!< TRNG clock */
    /* AHB3 peripherals */
    RCU_SEC_FLAG_SQPI      = RCU_REGIDX_BIT(AHB3SECPSTAT_REG_OFFSET, 0U),    /*!< SQPI clock */
    RCU_SEC_FLAG_QSPI      = RCU_REGIDX_BIT(AHB3SECPSTAT_REG_OFFSET, 1U),    /*!< QSPI clock */
    /* APB1 peripherals */
    RCU_SEC_FLAG_TIMER1    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 0U),    /*!< TIMER1 clock */
    RCU_SEC_FLAG_TIMER2    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 1U),    /*!< TIMER2 clock */
    RCU_SEC_FLAG_TIMER3    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 2U),    /*!< TIMER3 clock */
    RCU_SEC_FLAG_TIMER4    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 3U),    /*!< TIMER4 clock */
    RCU_SEC_FLAG_TIMER5    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 4U),    /*!< TIMER5 clock */
    RCU_SEC_FLAG_WWDGT     = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 11U),   /*!< WWDGT clock */
    RCU_SEC_FLAG_SPI1      = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 14U),   /*!< SPI1 clock */
    RCU_SEC_FLAG_USART1    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 17U),   /*!< USART1 clock */
    RCU_SEC_FLAG_USART0    = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 18U),   /*!< USART0 clock */
    RCU_SEC_FLAG_I2C0      = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 21U),   /*!< I2C0 clock */
    RCU_SEC_FLAG_I2C1      = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 22U),   /*!< I2C1 clock */
    RCU_SEC_FLAG_CTC       = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 27U),   /*!< CTC clock */
    RCU_SEC_FLAG_PMU       = RCU_REGIDX_BIT(APB1SECPSTAT_REG_OFFSET, 28U),   /*!< PMU clock */
    /* APB2 peripherals */
    RCU_SEC_FLAG_TIMER0    = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 0U),    /*!< TIMER0 clock */
    RCU_SEC_FLAG_USART2    = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 4U),    /*!< USART2 clock */
    RCU_SEC_FLAG_ADC       = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 8U),    /*!< ADC clock */
#if defined (GD32W515)
    RCU_SEC_FLAG_SDIO      = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 11U),   /*!< SDIO clock */
#endif /* GD32W515 */
    RCU_SEC_FLAG_SPI0      = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 12U),   /*!< SPI0 clock */
    RCU_SEC_FLAG_SYSCFG    = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 14U),   /*!< SYSCFG clock */
    RCU_SEC_FLAG_TIMER15   = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 17U),   /*!< TIMER15 clock */
    RCU_SEC_FLAG_TIMER16   = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 18U),   /*!< TIMER16 clock */
#if defined (GD32W515)
    RCU_SEC_FLAG_HPDF      = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 30U),   /*!< HPDF clock */
#endif /* defined (GD32W515) */
#if defined (GD32W515)
    RCU_SEC_FLAG_RF        = RCU_REGIDX_BIT(APB2SECPSTAT_REG_OFFSET, 31U)    /*!< RF clock */
#endif /* GD32W515 */
}rcu_sec_flag_enum;

/* RCU_CFG0 register bit define */
/* system clock source select */
#define CFG0_SCS(regval)                (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_CKSYSSRC_IRC16M             CFG0_SCS(0)                        /*!< system clock source select IRC16M */
#define RCU_CKSYSSRC_HXTAL              CFG0_SCS(1)                        /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_PLLP               CFG0_SCS(2)                        /*!< system clock source select PLLP */
#if defined (GD32F5HC)
#define RCU_CKSYSSRC_IRC48M             RCU_CFG0_SCS_1|CFG0_SCS(0)         /*!< system clock source select IRC48M */
#else
#define RCU_CKSYSSRC_PLLDIG             CFG0_SCS(3)                        /*!< system clock source select PLLDIG */
#endif /* GD32F5HC */

/* system clock source select status */
#define CFG0_SCSS(regval)               (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_SCSS_IRC16M                 CFG0_SCSS(0)                       /*!< system clock source select IRC16M */
#define RCU_SCSS_HXTAL                  CFG0_SCSS(1)                       /*!< system clock source select HXTAL */
#define RCU_SCSS_PLLP                   CFG0_SCSS(2)                       /*!< system clock source select PLLP */
#if defined (GD32F5HC)
#define RCU_SCSS_IRC48M                 RCU_CFG0_SCSS_1                    /*!< system clock source select IRC48M */
#else
#define RCU_SCSS_PLLDIG                 CFG0_SCSS(3)                       /*!< system clock source select PLLDIG */
#endif /* GD32F5HC */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)             (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_AHB_CKSYS_DIV1              CFG0_AHBPSC(0)                     /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2              CFG0_AHBPSC(8)                     /*!< AHB prescaler select CK_SYS/2 */
#define RCU_AHB_CKSYS_DIV4              CFG0_AHBPSC(9)                     /*!< AHB prescaler select CK_SYS/4 */
#define RCU_AHB_CKSYS_DIV8              CFG0_AHBPSC(10)                    /*!< AHB prescaler select CK_SYS/8 */
#define RCU_AHB_CKSYS_DIV16             CFG0_AHBPSC(11)                    /*!< AHB prescaler select CK_SYS/16 */
#define RCU_AHB_CKSYS_DIV64             CFG0_AHBPSC(12)                    /*!< AHB prescaler select CK_SYS/64 */
#define RCU_AHB_CKSYS_DIV128            CFG0_AHBPSC(13)                    /*!< AHB prescaler select CK_SYS/128 */
#define RCU_AHB_CKSYS_DIV256            CFG0_AHBPSC(14)                    /*!< AHB prescaler select CK_SYS/256 */
#define RCU_AHB_CKSYS_DIV512            CFG0_AHBPSC(15)                    /*!< AHB prescaler select CK_SYS/512 */

/* APB1 prescaler selection */
#define CFG0_APB1PSC(regval)            (BITS(10,12) & ((uint32_t)(regval) << 10U))
#define RCU_APB1_CKAHB_DIV4             CFG0_APB1PSC(5)                    /*!< APB1 prescaler select CK_AHB/4 */
#define RCU_APB1_CKAHB_DIV8             CFG0_APB1PSC(6)                    /*!< APB1 prescaler select CK_AHB/8 */
#define RCU_APB1_CKAHB_DIV16            CFG0_APB1PSC(7)                    /*!< APB1 prescaler select CK_AHB/16 */

/* APB2 prescaler selection */
#define CFG0_APB2PSC(regval)            (BITS(13,15) & ((uint32_t)(regval) << 13U))
#define RCU_APB2_CKAHB_DIV1             CFG0_APB2PSC(0)                    /*!< APB2 prescaler select CK_AHB */
#define RCU_APB2_CKAHB_DIV2             CFG0_APB2PSC(4)                    /*!< APB2 prescaler select CK_AHB/2 */
#define RCU_APB2_CKAHB_DIV4             CFG0_APB2PSC(5)                    /*!< APB2 prescaler select CK_AHB/4 */
#define RCU_APB2_CKAHB_DIV8             CFG0_APB2PSC(6)                    /*!< APB2 prescaler select CK_AHB/8 */
#define RCU_APB2_CKAHB_DIV16            CFG0_APB2PSC(7)                    /*!< APB2 prescaler select CK_AHB/16 */

/* RTC clock divider factor from HXTAL clock */
#define CFG0_RTCDIV(regval)             (BITS(16,20) & ((uint32_t)(regval) << 16U))
#define RCU_RTC_HXTAL_NONE              CFG0_RTCDIV(0)                     /*!< No clock for RTC */
#define RCU_RTC_HXTAL_DIV2              CFG0_RTCDIV(1)                     /*!< RTCDIV clock select CK_HXTAL/2 */
#define RCU_RTC_HXTAL_DIV3              CFG0_RTCDIV(2)                     /*!< RTCDIV clock select CK_HXTAL/3 */
#define RCU_RTC_HXTAL_DIV4              CFG0_RTCDIV(3)                     /*!< RTCDIV clock select CK_HXTAL/4 */
#define RCU_RTC_HXTAL_DIV5              CFG0_RTCDIV(4)                     /*!< RTCDIV clock select CK_HXTAL/5 */
#define RCU_RTC_HXTAL_DIV6              CFG0_RTCDIV(5)                     /*!< RTCDIV clock select CK_HXTAL/6 */
#define RCU_RTC_HXTAL_DIV7              CFG0_RTCDIV(6)                     /*!< RTCDIV clock select CK_HXTAL/7 */
#define RCU_RTC_HXTAL_DIV8              CFG0_RTCDIV(7)                     /*!< RTCDIV clock select CK_HXTAL/8 */
#define RCU_RTC_HXTAL_DIV9              CFG0_RTCDIV(8)                     /*!< RTCDIV clock select CK_HXTAL/9 */
#define RCU_RTC_HXTAL_DIV10             CFG0_RTCDIV(9)                     /*!< RTCDIV clock select CK_HXTAL/10 */
#define RCU_RTC_HXTAL_DIV11             CFG0_RTCDIV(10)                    /*!< RTCDIV clock select CK_HXTAL/11 */
#define RCU_RTC_HXTAL_DIV12             CFG0_RTCDIV(11)                    /*!< RTCDIV clock select CK_HXTAL/12 */
#define RCU_RTC_HXTAL_DIV13             CFG0_RTCDIV(12)                    /*!< RTCDIV clock select CK_HXTAL/13 */
#define RCU_RTC_HXTAL_DIV14             CFG0_RTCDIV(13)                    /*!< RTCDIV clock select CK_HXTAL/14 */
#define RCU_RTC_HXTAL_DIV15             CFG0_RTCDIV(14)                    /*!< RTCDIV clock select CK_HXTAL/15 */
#define RCU_RTC_HXTAL_DIV16             CFG0_RTCDIV(15)                    /*!< RTCDIV clock select CK_HXTAL/16 */
#define RCU_RTC_HXTAL_DIV17             CFG0_RTCDIV(16)                    /*!< RTCDIV clock select CK_HXTAL/17 */
#define RCU_RTC_HXTAL_DIV18             CFG0_RTCDIV(17)                    /*!< RTCDIV clock select CK_HXTAL/18 */
#define RCU_RTC_HXTAL_DIV19             CFG0_RTCDIV(18)                    /*!< RTCDIV clock select CK_HXTAL/19 */
#define RCU_RTC_HXTAL_DIV20             CFG0_RTCDIV(19)                    /*!< RTCDIV clock select CK_HXTAL/20 */
#define RCU_RTC_HXTAL_DIV21             CFG0_RTCDIV(20)                    /*!< RTCDIV clock select CK_HXTAL/21 */
#define RCU_RTC_HXTAL_DIV22             CFG0_RTCDIV(21)                    /*!< RTCDIV clock select CK_HXTAL/22 */
#define RCU_RTC_HXTAL_DIV23             CFG0_RTCDIV(22)                    /*!< RTCDIV clock select CK_HXTAL/23 */
#define RCU_RTC_HXTAL_DIV24             CFG0_RTCDIV(23)                    /*!< RTCDIV clock select CK_HXTAL/24 */
#define RCU_RTC_HXTAL_DIV25             CFG0_RTCDIV(24)                    /*!< RTCDIV clock select CK_HXTAL/25 */
#define RCU_RTC_HXTAL_DIV26             CFG0_RTCDIV(25)                    /*!< RTCDIV clock select CK_HXTAL/26 */
#define RCU_RTC_HXTAL_DIV27             CFG0_RTCDIV(26)                    /*!< RTCDIV clock select CK_HXTAL/27 */
#define RCU_RTC_HXTAL_DIV28             CFG0_RTCDIV(27)                    /*!< RTCDIV clock select CK_HXTAL/28 */
#define RCU_RTC_HXTAL_DIV29             CFG0_RTCDIV(28)                    /*!< RTCDIV clock select CK_HXTAL/29 */
#define RCU_RTC_HXTAL_DIV30             CFG0_RTCDIV(29)                    /*!< RTCDIV clock select CK_HXTAL/30 */
#define RCU_RTC_HXTAL_DIV31             CFG0_RTCDIV(30)                    /*!< RTCDIV clock select CK_HXTAL/31 */
#define RCU_RTC_HXTAL_DIV32             CFG0_RTCDIV(31)                    /*!< RTCDIV clock select CK_HXTAL/32 */

