burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* CKOUT0 Clock source selection */
#define CFG0_CKOUT0SEL(regval)          (BITS(21,22) & ((uint32_t)(regval) << 21U))
#define RCU_CKOUT0SRC_IRC16M            CFG0_CKOUT0SEL(0)                  /*!< internal 16M RC oscillator clock selected */
#define RCU_CKOUT0SRC_LXTAL             CFG0_CKOUT0SEL(1)                  /*!< low speed crystal oscillator clock (LXTAL) selected */
#define RCU_CKOUT0SRC_HXTAL             CFG0_CKOUT0SEL(2)                  /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUT0SRC_PLLP              CFG0_CKOUT0SEL(3)                  /*!< CK_PLLP clock selected */

/* The CK_OUT0 divider */
#define CFG0_CKOUT0DIV(regval)          (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_CKOUT0_DIV1                 CFG0_CKOUT0DIV(0)                  /*!< CK_OUT0 is divided by 1 */
#define RCU_CKOUT0_DIV2                 CFG0_CKOUT0DIV(4)                  /*!< CK_OUT0 is divided by 2 */
#define RCU_CKOUT0_DIV3                 CFG0_CKOUT0DIV(5)                  /*!< CK_OUT0 is divided by 3 */
#define RCU_CKOUT0_DIV4                 CFG0_CKOUT0DIV(6)                  /*!< CK_OUT0 is divided by 4 */
#define RCU_CKOUT0_DIV5                 CFG0_CKOUT0DIV(7)                  /*!< CK_OUT0 is divided by 5 */

/* CKOUT1 Clock source selection */
#define CFG0_CKOUT1SEL(regval)          (BITS(30,31) & ((uint32_t)(regval) << 30U))
#define RCU_CKOUT1SRC_CKSYS             CFG0_CKOUT1SEL(0)                  /*!< system clock selected */
#define RCU_CKOUT1SRC_PLLI2S            CFG0_CKOUT1SEL(1)                  /*!< CK_PLLI2S clock selected */
#define RCU_CKOUT1SRC_HXTAL             CFG0_CKOUT1SEL(2)                  /*!< high speed crystal oscillator clock (HXTAL) selected */
#if defined (GD32F5HC)
#define RCU_CKOUT1SRC_IRC48M            CFG0_CKOUT1SEL(3)                  /*!< CK_IRC48M clock selected */
#else
#define RCU_CKOUT1SRC_PLLDIG            CFG0_CKOUT1SEL(3)                  /*!< CK_PLLDIG clock selected */
#endif /* GD32F5HC */

/* The CK_OUT1 divider */
#define CFG0_CKOUT1DIV(regval)          (BITS(27,29) & ((uint32_t)(regval) << 27U))
#define RCU_CKOUT1_DIV1                 CFG0_CKOUT1DIV(0)                  /*!< CK_OUT1 is divided by 1 */
#define RCU_CKOUT1_DIV2                 CFG0_CKOUT1DIV(4)                  /*!< CK_OUT1 is divided by 2 */
#define RCU_CKOUT1_DIV3                 CFG0_CKOUT1DIV(5)                  /*!< CK_OUT1 is divided by 3 */
#define RCU_CKOUT1_DIV4                 CFG0_CKOUT1DIV(6)                  /*!< CK_OUT1 is divided by 4 */
#define RCU_CKOUT1_DIV5                 CFG0_CKOUT1DIV(7)                  /*!< CK_OUT1 is divided by 5 */

/* I2C0 Clock source selection */
#define CFG1_I2C0SEL(regval)            (BITS(26,27) & ((uint32_t)(regval) << 26U))
#define RCU_I2C0SRC_CKAPB1              CFG1_I2C0SEL(0)                    /*!< CKAPB1 clock selected as I2C0 source clock */
#define RCU_I2C0SRC_CKSYS               CFG1_I2C0SEL(1)                    /*!< System clock selected as I2C0 source clock */
#define RCU_I2C0SRC_IRC16M              CFG1_I2C0SEL(2)                    /*!< CK_IRC16M clock selected as I2C0 source clock */

#if defined (GD32F5HC)
/* I2C1 Clock source selection */
#define CFG1_I2C1SEL(regval)            (BITS(22,23) & ((uint32_t)(regval) << 22U))
#define RCU_I2C1SRC_CKAPB1              CFG1_I2C1SEL(0)                    /*!< CKAPB1 clock selected as I2C1 source clock */
#define RCU_I2C1SRC_CKSYS               CFG1_I2C1SEL(1)                    /*!< System clock selected as I2C1 source clock */
#define RCU_I2C1SRC_IRC16M              CFG1_I2C1SEL(2)                    /*!< CK_IRC16M clock selected as I2C1 source clock */
#endif /* GD32F5HC */

/* USART2 Clock source selection */
#define CFG1_USART2SEL(regval)            (BITS(28,29) & ((uint32_t)(regval) << 28U))
#define RCU_USART2SRC_CKAPB2              CFG1_USART2SEL(0)                 /*!< CKAPB2 clock selected as USART2 source clock */
#define RCU_USART2SRC_CKSYS               CFG1_USART2SEL(1)                /*!< SYSCLK selected as USART2 source clock */
#define RCU_USART2SRC_LXTAL               CFG1_USART2SEL(2)                /*!< CK_LXTAL selected as USART2 source clock */
#define RCU_USART2SRC_IRC16M              CFG1_USART2SEL(3)                /*!< CK_IRC16M selected as USART2 source clock */

/* USART0 Clock source selection */
#define CFG1_USART0SEL(regval)            (BITS(30,31) & ((uint32_t)(regval) << 30U))
#define RCU_USART0SRC_CKAPB1              CFG1_USART0SEL(0)                /*!< CKAPB1 clock selected as USART0 source clock */
#define RCU_USART0SRC_CKSYS               CFG1_USART0SEL(1)                /*!< SYSCLK selected as USART0 source clock */
#define RCU_USART0SRC_LXTAL               CFG1_USART0SEL(2)                /*!< CK_LXTAL selected as USART0 source clock */
#define RCU_USART0SRC_IRC16M              CFG1_USART0SEL(3)                /*!< CK_IRC16M selected as USART0 source clock */

/* USBFS Clock source selection */
#define RCU_USBFSSRC_PLL               ((uint32_t)0x00000000U)             /*!< PLL output clock selected as USBFS source clock */
#if defined (GD32F5HC)
#define RCU_USBFSSRC_IRC48M             RCU_ADDCTL_USBFSSEL                /*!< IRC48M selected as USBFS source clock */
#else
#define RCU_USBFSSRC_PLLDIG             RCU_ADDCTL_USBFSSEL                /*!< PLLDIG selected as USBFS source clock */
#endif /* GD32F5HC */

/* RCU_ADDCTL register bit define */
/* the divider factor from USBFS clock */
#define ADDCTL_USBFSDIV(regval)        (BITS(1,5) & ((uint32_t)(regval) << 1U))
#define RCU_USBFS_DIV1                  ADDCTL_USBFSDIV(0)                          /*!< USBFSDIV input source clock divided by 1 */
#define RCU_USBFS_DIV2                  ADDCTL_USBFSDIV(1)                          /*!< USBFSDIV input source clock divided by 2 */
#define RCU_USBFS_DIV3                  ADDCTL_USBFSDIV(2)                          /*!< USBFSDIV input source clock divided by 3 */
#define RCU_USBFS_DIV4                  ADDCTL_USBFSDIV(3)                          /*!< USBFSDIV input source clock divided by 4 */
#define RCU_USBFS_DIV5                  ADDCTL_USBFSDIV(4)                          /*!< USBFSDIV input source clock divided by 5 */
#define RCU_USBFS_DIV6                  ADDCTL_USBFSDIV(5)                          /*!< USBFSDIV input source clock divided by 6 */
#define RCU_USBFS_DIV7                  ADDCTL_USBFSDIV(6)                          /*!< USBFSDIV input source clock divided by 7 */
#define RCU_USBFS_DIV8                  ADDCTL_USBFSDIV(7)                          /*!< USBFSDIV input source clock divided by 8 */
#define RCU_USBFS_DIV9                  ADDCTL_USBFSDIV(8)                          /*!< USBFSDIV input source clock divided by 9 */
#define RCU_USBFS_DIV10                 ADDCTL_USBFSDIV(9)                          /*!< USBFSDIV input source clock divided by 10 */
#define RCU_USBFS_DIV11                 ADDCTL_USBFSDIV(10)                         /*!< USBFSDIV input source clock divided by 11 */
#define RCU_USBFS_DIV12                 ADDCTL_USBFSDIV(11)                         /*!< USBFSDIV input source clock divided by 12 */
#define RCU_USBFS_DIV13                 ADDCTL_USBFSDIV(12)                         /*!< USBFSDIV input source clock divided by 13 */
#define RCU_USBFS_DIV14                 ADDCTL_USBFSDIV(13)                         /*!< USBFSDIV input source clock divided by 14 */
#define RCU_USBFS_DIV15                 ADDCTL_USBFSDIV(14)                         /*!< USBFSDIV input source clock divided by 15 */
#define RCU_USBFS_DIV16                 ADDCTL_USBFSDIV(15)                         /*!< USBFSDIV input source clock divided by 16 */
#define RCU_USBFS_DIV17                 ADDCTL_USBFSDIV(16)                         /*!< USBFSDIV input source clock divided by 17 */
#define RCU_USBFS_DIV18                 ADDCTL_USBFSDIV(17)                         /*!< USBFSDIV input source clock divided by 18 */
#define RCU_USBFS_DIV19                 ADDCTL_USBFSDIV(18)                         /*!< USBFSDIV input source clock divided by 19 */
#define RCU_USBFS_DIV20                 ADDCTL_USBFSDIV(19)                         /*!< USBFSDIV input source clock divided by 20 */
#define RCU_USBFS_DIV21                 ADDCTL_USBFSDIV(20)                         /*!< USBFSDIV input source clock divided by 21 */
#define RCU_USBFS_DIV22                 ADDCTL_USBFSDIV(21)                         /*!< USBFSDIV input source clock divided by 22 */
#define RCU_USBFS_DIV23                 ADDCTL_USBFSDIV(22)                         /*!< USBFSDIV input source clock divided by 23 */
#define RCU_USBFS_DIV24                 ADDCTL_USBFSDIV(23)                         /*!< USBFSDIV input source clock divided by 24 */
#define RCU_USBFS_DIV25                 ADDCTL_USBFSDIV(24)                         /*!< USBFSDIV input source clock divided by 25 */
#define RCU_USBFS_DIV26                 ADDCTL_USBFSDIV(25)                         /*!< USBFSDIV input source clock divided by 26 */
#define RCU_USBFS_DIV27                 ADDCTL_USBFSDIV(26)                         /*!< USBFSDIV input source clock divided by 27 */
#define RCU_USBFS_DIV28                 ADDCTL_USBFSDIV(27)                         /*!< USBFSDIV input source clock divided by 28 */
#define RCU_USBFS_DIV29                 ADDCTL_USBFSDIV(28)                         /*!< USBFSDIV input source clock divided by 29 */
#define RCU_USBFS_DIV30                 ADDCTL_USBFSDIV(29)                         /*!< USBFSDIV input source clock divided by 30 */
#define RCU_USBFS_DIV31                 ADDCTL_USBFSDIV(30)                         /*!< USBFSDIV input source clock divided by 31 */
#define RCU_USBFS_DIV32                 ADDCTL_USBFSDIV(31)                         /*!< USBFSDIV input source clock divided by 32 */

