burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
#if defined (GD32W515)
/* HPDF Clock source selection */
#define RCU_HPDFSRC_PCLK2               ((uint32_t)0x00000000U)                       /*!< PCLK2 clock selected as HPDF source clock */
#define RCU_HPDFSRC_CKSYS               RCU_ADDCTL_HPDFSEL                            /*!< system Clock selected as HPDF source clock */
#endif /* defined (GD32W515) */

/* I2S Clock source selection */
#define ADDCTL_I2SSEL(regval)           (BITS(12,13) & ((uint32_t)(regval) << 12U))
#define RCU_I2SSRC_PLLI2S               ADDCTL_I2SSEL(0)                              /*!< PLLI2S output clock selected as I2S source clock */
#define RCU_I2SSRC_I2S_CKIN             ADDCTL_I2SSEL(1)                              /*!< external I2S_CKIN pin selected as I2S source clock */
#define RCU_I2SSRC_I2S_PLLDIV           ADDCTL_I2SSEL(2)                              /*!< PLL division selected as I2S source clock */

#if defined (GD32W515)
/* HPDFAUDIO Clock source selection */
#define ADDCTL_HPDFAUDIOSEL(regval)     (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define RCU_HPDFAUDIOSRC_PLLI2S          ADDCTL_HPDFAUDIOSEL(0)                       /*!< PLLI2S output clock selected as I2S source clock */
#define RCU_HPDFAUDIOSRC_I2S_CKIN        ADDCTL_HPDFAUDIOSEL(1)                       /*!< external I2S_CKIN pin selected as I2S source clock */
#define RCU_HPDFAUDIOSRC_PLL             ADDCTL_HPDFAUDIOSEL(2)                       /*!< PLL selected as I2S source clock */
#define RCU_HPDFAUDIOSRC_IRC16M          ADDCTL_HPDFAUDIOSEL(3)                       /*!< IRC16M selected as I2S source clock */
#endif /* defined (GD32W515) */

/* SDIO Clock source selection */
#define RCU_SDIOSRC_MASK                 0X00410000U
#define RCU_SDIOSRC_PLL                  0X00000000U                                  /*!< select PLL clock */
#define RCU_SDIOSRC_PLLDIG               RCU_ADDCTL_SDIOSEL_0                         /*!< select PLLDIG clock */
#define RCU_SDIOSRC_IRC16M               RCU_ADDCTL_SDIOSEL_1                         /*!< select IRC16M */
#define RCU_SDIOSRC_HXTAL                RCU_ADDCTL_SDIOSEL_0 | RCU_ADDCTL_SDIOSEL_1  /*!< select HXTAL */

/* SDIODIV division factor */
#define ADDCTL_SDIODIV(regval)            (BITS(17,21) & ((uint32_t)(regval) << 17U))
#define RCU_SDIODIV_DIV1                  ADDCTL_SDIODIV(0)                         /*!< SDIODIV input source clock divided by 1 */
#define RCU_SDIODIV_DIV2                  ADDCTL_SDIODIV(1)                         /*!< SDIODIV input source clock divided by 2 */
#define RCU_SDIODIV_DIV3                  ADDCTL_SDIODIV(2)                         /*!< SDIODIV input source clock divided by 3 */
#define RCU_SDIODIV_DIV4                  ADDCTL_SDIODIV(3)                         /*!< SDIODIV input source clock divided by 4 */
#define RCU_SDIODIV_DIV5                  ADDCTL_SDIODIV(4)                         /*!< SDIODIV input source clock divided by 5 */
#define RCU_SDIODIV_DIV6                  ADDCTL_SDIODIV(5)                         /*!< SDIODIV input source clock divided by 6 */
#define RCU_SDIODIV_DIV7                  ADDCTL_SDIODIV(6)                         /*!< SDIODIV input source clock divided by 7 */
#define RCU_SDIODIV_DIV8                  ADDCTL_SDIODIV(7)                         /*!< SDIODIV input source clock divided by 8 */
#define RCU_SDIODIV_DIV9                  ADDCTL_SDIODIV(8)                         /*!< SDIODIV input source clock divided by 9 */
#define RCU_SDIODIV_DIV10                 ADDCTL_SDIODIV(9)                         /*!< SDIODIV input source clock divided by 10 */
#define RCU_SDIODIV_DIV11                 ADDCTL_SDIODIV(10)                        /*!< SDIODIV input source clock divided by 11 */
#define RCU_SDIODIV_DIV12                 ADDCTL_SDIODIV(11)                        /*!< SDIODIV input source clock divided by 12 */
#define RCU_SDIODIV_DIV13                 ADDCTL_SDIODIV(12)                        /*!< SDIODIV input source clock divided by 13 */
#define RCU_SDIODIV_DIV14                 ADDCTL_SDIODIV(13)                        /*!< SDIODIV input source clock divided by 14 */
#define RCU_SDIODIV_DIV15                 ADDCTL_SDIODIV(14)                        /*!< SDIODIV input source clock divided by 15 */
#define RCU_SDIODIV_DIV16                 ADDCTL_SDIODIV(15)                        /*!< SDIODIV input source clock divided by 16 */
#define RCU_SDIODIV_DIV17                 ADDCTL_SDIODIV(16)                        /*!< SDIODIV input source clock divided by 17 */
#define RCU_SDIODIV_DIV18                 ADDCTL_SDIODIV(17)                        /*!< SDIODIV input source clock divided by 18 */
#define RCU_SDIODIV_DIV19                 ADDCTL_SDIODIV(18)                        /*!< SDIODIV input source clock divided by 19 */
#define RCU_SDIODIV_DIV20                 ADDCTL_SDIODIV(19)                        /*!< SDIODIV input source clock divided by 20 */
#define RCU_SDIODIV_DIV21                 ADDCTL_SDIODIV(20)                        /*!< SDIODIV input source clock divided by 21 */
#define RCU_SDIODIV_DIV22                 ADDCTL_SDIODIV(21)                        /*!< SDIODIV input source clock divided by 22 */
#define RCU_SDIODIV_DIV23                 ADDCTL_SDIODIV(22)                        /*!< SDIODIV input source clock divided by 23 */
#define RCU_SDIODIV_DIV24                 ADDCTL_SDIODIV(23)                        /*!< SDIODIV input source clock divided by 24 */
#define RCU_SDIODIV_DIV25                 ADDCTL_SDIODIV(24)                        /*!< SDIODIV input source clock divided by 25 */
#define RCU_SDIODIV_DIV26                 ADDCTL_SDIODIV(25)                        /*!< SDIODIV input source clock divided by 26 */
#define RCU_SDIODIV_DIV27                 ADDCTL_SDIODIV(26)                        /*!< SDIODIV input source clock divided by 27 */
#define RCU_SDIODIV_DIV28                 ADDCTL_SDIODIV(27)                        /*!< SDIODIV input source clock divided by 28 */
#define RCU_SDIODIV_DIV29                 ADDCTL_SDIODIV(28)                        /*!< SDIODIV input source clock divided by 29 */
#define RCU_SDIODIV_DIV30                 ADDCTL_SDIODIV(29)                        /*!< SDIODIV input source clock divided by 30 */
#define RCU_SDIODIV_DIV31                 ADDCTL_SDIODIV(30)                        /*!< SDIODIV input source clock divided by 31 */
#define RCU_SDIODIV_DIV32                 ADDCTL_SDIODIV(31)                        /*!< SDIODIV input source clock divided by 32 */

