burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* RCU_ADDCTL register bit define */
/* PLLDIV_I2S division factor */
#define ADDCTL_PLLDIV_I2S(regval)         (BITS(24,29) & ((uint32_t)(regval) << 24U))
#define RCU_PLLDIV_I2S_DIV1               ADDCTL_PLLDIV_I2S(0)                      /*!< PLL clock divided by 1 for I2S clock */
#define RCU_PLLDIV_I2S_DIV2               ADDCTL_PLLDIV_I2S(1)                      /*!< PLL clock divided by 2 for I2S clock */
#define RCU_PLLDIV_I2S_DIV3               ADDCTL_PLLDIV_I2S(2)                      /*!< PLL clock divided by 3 for I2S clock */
#define RCU_PLLDIV_I2S_DIV4               ADDCTL_PLLDIV_I2S(3)                      /*!< PLL clock divided by 4 for I2S clock */
#define RCU_PLLDIV_I2S_DIV5               ADDCTL_PLLDIV_I2S(4)                      /*!< PLL clock divided by 5 for I2S clock */
#define RCU_PLLDIV_I2S_DIV6               ADDCTL_PLLDIV_I2S(5)                      /*!< PLL clock divided by 6 for I2S clock */
#define RCU_PLLDIV_I2S_DIV7               ADDCTL_PLLDIV_I2S(6)                      /*!< PLL clock divided by 7 for I2S clock */
#define RCU_PLLDIV_I2S_DIV8               ADDCTL_PLLDIV_I2S(7)                      /*!< PLL clock divided by 8 for I2S clock */
#define RCU_PLLDIV_I2S_DIV9               ADDCTL_PLLDIV_I2S(8)                      /*!< PLL clock divided by 9 for I2S clock */
#define RCU_PLLDIV_I2S_DIV10              ADDCTL_PLLDIV_I2S(9)                      /*!< PLL clock divided by 10 for I2S clock */
#define RCU_PLLDIV_I2S_DIV11              ADDCTL_PLLDIV_I2S(10)                     /*!< PLL clock divided by 11 for I2S clock */
#define RCU_PLLDIV_I2S_DIV12              ADDCTL_PLLDIV_I2S(11)                     /*!< PLL clock divided by 12 for I2S clock */
#define RCU_PLLDIV_I2S_DIV13              ADDCTL_PLLDIV_I2S(12)                     /*!< PLL clock divided by 13 for I2S clock */
#define RCU_PLLDIV_I2S_DIV14              ADDCTL_PLLDIV_I2S(13)                     /*!< PLL clock divided by 14 for I2S clock */
#define RCU_PLLDIV_I2S_DIV15              ADDCTL_PLLDIV_I2S(14)                     /*!< PLL clock divided by 15 for I2S clock */
#define RCU_PLLDIV_I2S_DIV16              ADDCTL_PLLDIV_I2S(15)                     /*!< PLL clock divided by 16 for I2S clock */
#define RCU_PLLDIV_I2S_DIV17              ADDCTL_PLLDIV_I2S(16)                     /*!< PLL clock divided by 17 for I2S clock */
#define RCU_PLLDIV_I2S_DIV18              ADDCTL_PLLDIV_I2S(17)                     /*!< PLL clock divided by 18 for I2S clock */
#define RCU_PLLDIV_I2S_DIV19              ADDCTL_PLLDIV_I2S(18)                     /*!< PLL clock divided by 19 for I2S clock */
#define RCU_PLLDIV_I2S_DIV20              ADDCTL_PLLDIV_I2S(19)                     /*!< PLL clock divided by 20 for I2S clock */
#define RCU_PLLDIV_I2S_DIV21              ADDCTL_PLLDIV_I2S(20)                     /*!< PLL clock divided by 21 for I2S clock */
#define RCU_PLLDIV_I2S_DIV22              ADDCTL_PLLDIV_I2S(21)                     /*!< PLL clock divided by 22 for I2S clock */
#define RCU_PLLDIV_I2S_DIV23              ADDCTL_PLLDIV_I2S(22)                     /*!< PLL clock divided by 23 for I2S clock */
#define RCU_PLLDIV_I2S_DIV24              ADDCTL_PLLDIV_I2S(23)                     /*!< PLL clock divided by 24 for I2S clock */
#define RCU_PLLDIV_I2S_DIV25              ADDCTL_PLLDIV_I2S(24)                     /*!< PLL clock divided by 25 for I2S clock */
#define RCU_PLLDIV_I2S_DIV26              ADDCTL_PLLDIV_I2S(25)                     /*!< PLL clock divided by 26 for I2S clock */
#define RCU_PLLDIV_I2S_DIV27              ADDCTL_PLLDIV_I2S(26)                     /*!< PLL clock divided by 27 for I2S clock */
#define RCU_PLLDIV_I2S_DIV28              ADDCTL_PLLDIV_I2S(27)                     /*!< PLL clock divided by 28 for I2S clock */
#define RCU_PLLDIV_I2S_DIV29              ADDCTL_PLLDIV_I2S(28)                     /*!< PLL clock divided by 29 for I2S clock */
#define RCU_PLLDIV_I2S_DIV30              ADDCTL_PLLDIV_I2S(29)                     /*!< PLL clock divided by 30 for I2S clock */
#define RCU_PLLDIV_I2S_DIV31              ADDCTL_PLLDIV_I2S(30)                     /*!< PLL clock divided by 31 for I2S clock */
#define RCU_PLLDIV_I2S_DIV32              ADDCTL_PLLDIV_I2S(31)                     /*!< PLL clock divided by 32 for I2S clock */
#define RCU_PLLDIV_I2S_DIV33              ADDCTL_PLLDIV_I2S(32)                     /*!< PLL clock divided by 33 for I2S clock */
#define RCU_PLLDIV_I2S_DIV34              ADDCTL_PLLDIV_I2S(33)                     /*!< PLL clock divided by 34 for I2S clock */
#define RCU_PLLDIV_I2S_DIV35              ADDCTL_PLLDIV_I2S(34)                     /*!< PLL clock divided by 35 for I2S clock */
#define RCU_PLLDIV_I2S_DIV36              ADDCTL_PLLDIV_I2S(35)                     /*!< PLL clock divided by 36 for I2S clock */
#define RCU_PLLDIV_I2S_DIV37              ADDCTL_PLLDIV_I2S(36)                     /*!< PLL clock divided by 37 for I2S clock */
#define RCU_PLLDIV_I2S_DIV38              ADDCTL_PLLDIV_I2S(37)                     /*!< PLL clock divided by 38 for I2S clock */
#define RCU_PLLDIV_I2S_DIV39              ADDCTL_PLLDIV_I2S(38)                     /*!< PLL clock divided by 39 for I2S clock */
#define RCU_PLLDIV_I2S_DIV40              ADDCTL_PLLDIV_I2S(39)                     /*!< PLL clock divided by 40 for I2S clock */
#define RCU_PLLDIV_I2S_DIV41              ADDCTL_PLLDIV_I2S(40)                     /*!< PLL clock divided by 41 for I2S clock */
#define RCU_PLLDIV_I2S_DIV42              ADDCTL_PLLDIV_I2S(41)                     /*!< PLL clock divided by 42 for I2S clock */
#define RCU_PLLDIV_I2S_DIV43              ADDCTL_PLLDIV_I2S(42)                     /*!< PLL clock divided by 43 for I2S clock */
#define RCU_PLLDIV_I2S_DIV44              ADDCTL_PLLDIV_I2S(43)                     /*!< PLL clock divided by 44 for I2S clock */
#define RCU_PLLDIV_I2S_DIV45              ADDCTL_PLLDIV_I2S(44)                     /*!< PLL clock divided by 45 for I2S clock */
#define RCU_PLLDIV_I2S_DIV46              ADDCTL_PLLDIV_I2S(45)                     /*!< PLL clock divided by 46 for I2S clock */
#define RCU_PLLDIV_I2S_DIV47              ADDCTL_PLLDIV_I2S(46)                     /*!< PLL clock divided by 47 for I2S clock */
#define RCU_PLLDIV_I2S_DIV48              ADDCTL_PLLDIV_I2S(47)                     /*!< PLL clock divided by 48 for I2S clock */
#define RCU_PLLDIV_I2S_DIV49              ADDCTL_PLLDIV_I2S(48)                     /*!< PLL clock divided by 49 for I2S clock */
#define RCU_PLLDIV_I2S_DIV50              ADDCTL_PLLDIV_I2S(49)                     /*!< PLL clock divided by 50 for I2S clock */
#define RCU_PLLDIV_I2S_DIV51              ADDCTL_PLLDIV_I2S(50)                     /*!< PLL clock divided by 51 for I2S clock */
#define RCU_PLLDIV_I2S_DIV52              ADDCTL_PLLDIV_I2S(51)                     /*!< PLL clock divided by 52 for I2S clock */
#define RCU_PLLDIV_I2S_DIV53              ADDCTL_PLLDIV_I2S(52)                     /*!< PLL clock divided by 53 for I2S clock */
#define RCU_PLLDIV_I2S_DIV54              ADDCTL_PLLDIV_I2S(53)                     /*!< PLL clock divided by 54 for I2S clock */
#define RCU_PLLDIV_I2S_DIV55              ADDCTL_PLLDIV_I2S(54)                     /*!< PLL clock divided by 55 for I2S clock */
#define RCU_PLLDIV_I2S_DIV56              ADDCTL_PLLDIV_I2S(55)                     /*!< PLL clock divided by 56 for I2S clock */
#define RCU_PLLDIV_I2S_DIV57              ADDCTL_PLLDIV_I2S(56)                     /*!< PLL clock divided by 57 for I2S clock */
#define RCU_PLLDIV_I2S_DIV58              ADDCTL_PLLDIV_I2S(57)                     /*!< PLL clock divided by 58 for I2S clock */
#define RCU_PLLDIV_I2S_DIV59              ADDCTL_PLLDIV_I2S(58)                     /*!< PLL clock divided by 59 for I2S clock */
#define RCU_PLLDIV_I2S_DIV60              ADDCTL_PLLDIV_I2S(59)                     /*!< PLL clock divided by 60 for I2S clock */
#define RCU_PLLDIV_I2S_DIV61              ADDCTL_PLLDIV_I2S(60)                     /*!< PLL clock divided by 61 for I2S clock */
#define RCU_PLLDIV_I2S_DIV62              ADDCTL_PLLDIV_I2S(61)                     /*!< PLL clock divided by 62 for I2S clock */
#define RCU_PLLDIV_I2S_DIV63              ADDCTL_PLLDIV_I2S(62)                     /*!< PLL clock divided by 63 for I2S clock */
#define RCU_PLLDIV_I2S_DIV64              ADDCTL_PLLDIV_I2S(63)                     /*!< PLL clock divided by 64 for I2S clock */

/* TIMER clock selection */
#define RCU_TIMER_PSC_MUL2              ~RCU_CFG1_TIMERSEL                 /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB)
                                                                                or 0b100(CK_APBx = CK_AHB/2), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                                                                or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1;
                                                                                TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2) */
#define RCU_TIMER_PSC_MUL4              RCU_CFG1_TIMERSEL                  /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB),
                                                                                0b100(CK_APBx = CK_AHB/2), or 0b101(CK_APBx = CK_AHB/4), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                                                                or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;
                                                                                TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2) */

