burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_rcu.h
/* PLLI2S VCO source clock pre-scale */
#define PLLCFG_PLLI2SPSC(regval)         (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_PLLI2SSRC_DIV1                PLLCFG_PLLI2SPSC(0)                       /*!< PLLI2S vco input source clock divided by 1 */
#define RCU_PLLI2SSRC_DIV2                PLLCFG_PLLI2SPSC(1)                       /*!< PLLI2S vco input source clock divided by 2 */
#define RCU_PLLI2SSRC_DIV3                PLLCFG_PLLI2SPSC(2)                       /*!< PLLI2S vco input source clock divided by 3 */
#define RCU_PLLI2SSRC_DIV4                PLLCFG_PLLI2SPSC(3)                       /*!< PLLI2S vco input source clock divided by 4 */
#define RCU_PLLI2SSRC_DIV5                PLLCFG_PLLI2SPSC(4)                       /*!< PLLI2S vco input source clock divided by 5 */
#define RCU_PLLI2SSRC_DIV6                PLLCFG_PLLI2SPSC(5)                       /*!< PLLI2S vco input source clock divided by 6 */
#define RCU_PLLI2SSRC_DIV7                PLLCFG_PLLI2SPSC(6)                       /*!< PLLI2S vco input source clock divided by 7 */
#define RCU_PLLI2SSRC_DIV8                PLLCFG_PLLI2SPSC(7)                       /*!< PLLI2S vco input source clock divided by 8 */

#if defined (GD32W515)
/* PLLDIG clock divider factor for system clock */
#define PLLCFG_PLLDIGDIV_SYS(regval)     (BITS(26,31) & ((uint32_t)(regval) << 26U))
#define RCU_PLLDIG_SYS_DIV1               PLLCFG_PLLDIGDIV_SYS(0)                   /*!< PLLDIG clock divided by 1 for system clock */
#define RCU_PLLDIG_SYS_DIV2               PLLCFG_PLLDIGDIV_SYS(1)                   /*!< PLLDIG clock divided by 2 for system clock */
#define RCU_PLLDIG_SYS_DIV3               PLLCFG_PLLDIGDIV_SYS(2)                   /*!< PLLDIG clock divided by 3 for system clock */
#define RCU_PLLDIG_SYS_DIV4               PLLCFG_PLLDIGDIV_SYS(3)                   /*!< PLLDIG clock divided by 4 for system clock */
#define RCU_PLLDIG_SYS_DIV5               PLLCFG_PLLDIGDIV_SYS(4)                   /*!< PLLDIG clock divided by 5 for system clock */
#define RCU_PLLDIG_SYS_DIV6               PLLCFG_PLLDIGDIV_SYS(5)                   /*!< PLLDIG clock divided by 6 for system clock */
#define RCU_PLLDIG_SYS_DIV7               PLLCFG_PLLDIGDIV_SYS(6)                   /*!< PLLDIG clock divided by 7 for system clock */
#define RCU_PLLDIG_SYS_DIV8               PLLCFG_PLLDIGDIV_SYS(7)                   /*!< PLLDIG clock divided by 8 for system clock */
#define RCU_PLLDIG_SYS_DIV9               PLLCFG_PLLDIGDIV_SYS(8)                   /*!< PLLDIG clock divided by 9 for system clock */
#define RCU_PLLDIG_SYS_DIV10              PLLCFG_PLLDIGDIV_SYS(9)                   /*!< PLLDIG clock divided by 10 for system clock */
#define RCU_PLLDIG_SYS_DIV11              PLLCFG_PLLDIGDIV_SYS(10)                  /*!< PLLDIG clock divided by 11 for system clock */
#define RCU_PLLDIG_SYS_DIV12              PLLCFG_PLLDIGDIV_SYS(11)                  /*!< PLLDIG clock divided by 12 for system clock */
#define RCU_PLLDIG_SYS_DIV13              PLLCFG_PLLDIGDIV_SYS(12)                  /*!< PLLDIG clock divided by 13 for system clock */
#define RCU_PLLDIG_SYS_DIV14              PLLCFG_PLLDIGDIV_SYS(13)                  /*!< PLLDIG clock divided by 14 for system clock */
#define RCU_PLLDIG_SYS_DIV15              PLLCFG_PLLDIGDIV_SYS(14)                  /*!< PLLDIG clock divided by 15 for system clock */
#define RCU_PLLDIG_SYS_DIV16              PLLCFG_PLLDIGDIV_SYS(15)                  /*!< PLLDIG clock divided by 16 for system clock */
#define RCU_PLLDIG_SYS_DIV17              PLLCFG_PLLDIGDIV_SYS(16)                  /*!< PLLDIG clock divided by 17 for system clock */
#define RCU_PLLDIG_SYS_DIV18              PLLCFG_PLLDIGDIV_SYS(17)                  /*!< PLLDIG clock divided by 18 for system clock */
#define RCU_PLLDIG_SYS_DIV19              PLLCFG_PLLDIGDIV_SYS(18)                  /*!< PLLDIG clock divided by 19 for system clock */
#define RCU_PLLDIG_SYS_DIV20              PLLCFG_PLLDIGDIV_SYS(19)                  /*!< PLLDIG clock divided by 20 for system clock */
#define RCU_PLLDIG_SYS_DIV21              PLLCFG_PLLDIGDIV_SYS(20)                  /*!< PLLDIG clock divided by 21 for system clock */
#define RCU_PLLDIG_SYS_DIV22              PLLCFG_PLLDIGDIV_SYS(21)                  /*!< PLLDIG clock divided by 22 for system clock */
#define RCU_PLLDIG_SYS_DIV23              PLLCFG_PLLDIGDIV_SYS(22)                  /*!< PLLDIG clock divided by 23 for system clock */
#define RCU_PLLDIG_SYS_DIV24              PLLCFG_PLLDIGDIV_SYS(23)                  /*!< PLLDIG clock divided by 24 for system clock */
#define RCU_PLLDIG_SYS_DIV25              PLLCFG_PLLDIGDIV_SYS(24)                  /*!< PLLDIG clock divided by 25 for system clock */
#define RCU_PLLDIG_SYS_DIV26              PLLCFG_PLLDIGDIV_SYS(25)                  /*!< PLLDIG clock divided by 26 for system clock */
#define RCU_PLLDIG_SYS_DIV27              PLLCFG_PLLDIGDIV_SYS(26)                  /*!< PLLDIG clock divided by 27 for system clock */
#define RCU_PLLDIG_SYS_DIV28              PLLCFG_PLLDIGDIV_SYS(27)                  /*!< PLLDIG clock divided by 28 for system clock */
#define RCU_PLLDIG_SYS_DIV29              PLLCFG_PLLDIGDIV_SYS(28)                  /*!< PLLDIG clock divided by 29 for system clock */
#define RCU_PLLDIG_SYS_DIV30              PLLCFG_PLLDIGDIV_SYS(29)                  /*!< PLLDIG clock divided by 30 for system clock */
#define RCU_PLLDIG_SYS_DIV31              PLLCFG_PLLDIGDIV_SYS(30)                  /*!< PLLDIG clock divided by 31 for system clock */
#define RCU_PLLDIG_SYS_DIV32              PLLCFG_PLLDIGDIV_SYS(31)                  /*!< PLLDIG clock divided by 32 for system clock */
#define RCU_PLLDIG_SYS_DIV33              PLLCFG_PLLDIGDIV_SYS(32)                  /*!< PLLDIG clock divided by 33 for system clock */
#define RCU_PLLDIG_SYS_DIV34              PLLCFG_PLLDIGDIV_SYS(33)                  /*!< PLLDIG clock divided by 34 for system clock */
#define RCU_PLLDIG_SYS_DIV35              PLLCFG_PLLDIGDIV_SYS(34)                  /*!< PLLDIG clock divided by 35 for system clock */
#define RCU_PLLDIG_SYS_DIV36              PLLCFG_PLLDIGDIV_SYS(35)                  /*!< PLLDIG clock divided by 36 for system clock */
#define RCU_PLLDIG_SYS_DIV37              PLLCFG_PLLDIGDIV_SYS(36)                  /*!< PLLDIG clock divided by 37 for system clock */
#define RCU_PLLDIG_SYS_DIV38              PLLCFG_PLLDIGDIV_SYS(37)                  /*!< PLLDIG clock divided by 38 for system clock */
#define RCU_PLLDIG_SYS_DIV39              PLLCFG_PLLDIGDIV_SYS(38)                  /*!< PLLDIG clock divided by 39 for system clock */
#define RCU_PLLDIG_SYS_DIV40              PLLCFG_PLLDIGDIV_SYS(39)                  /*!< PLLDIG clock divided by 40 for system clock */
#define RCU_PLLDIG_SYS_DIV41              PLLCFG_PLLDIGDIV_SYS(40)                  /*!< PLLDIG clock divided by 41 for system clock */
#define RCU_PLLDIG_SYS_DIV42              PLLCFG_PLLDIGDIV_SYS(41)                  /*!< PLLDIG clock divided by 42 for system clock */
#define RCU_PLLDIG_SYS_DIV43              PLLCFG_PLLDIGDIV_SYS(42)                  /*!< PLLDIG clock divided by 43 for system clock */
#define RCU_PLLDIG_SYS_DIV44              PLLCFG_PLLDIGDIV_SYS(43)                  /*!< PLLDIG clock divided by 44 for system clock */
#define RCU_PLLDIG_SYS_DIV45              PLLCFG_PLLDIGDIV_SYS(44)                  /*!< PLLDIG clock divided by 45 for system clock */
#define RCU_PLLDIG_SYS_DIV46              PLLCFG_PLLDIGDIV_SYS(45)                  /*!< PLLDIG clock divided by 46 for system clock */
#define RCU_PLLDIG_SYS_DIV47              PLLCFG_PLLDIGDIV_SYS(46)                  /*!< PLLDIG clock divided by 47 for system clock */
#define RCU_PLLDIG_SYS_DIV48              PLLCFG_PLLDIGDIV_SYS(47)                  /*!< PLLDIG clock divided by 48 for system clock */
#define RCU_PLLDIG_SYS_DIV49              PLLCFG_PLLDIGDIV_SYS(48)                  /*!< PLLDIG clock divided by 49 for system clock */
#define RCU_PLLDIG_SYS_DIV50              PLLCFG_PLLDIGDIV_SYS(49)                  /*!< PLLDIG clock divided by 50 for system clock */
#define RCU_PLLDIG_SYS_DIV51              PLLCFG_PLLDIGDIV_SYS(50)                  /*!< PLLDIG clock divided by 51 for system clock */
#define RCU_PLLDIG_SYS_DIV52              PLLCFG_PLLDIGDIV_SYS(51)                  /*!< PLLDIG clock divided by 52 for system clock */
#define RCU_PLLDIG_SYS_DIV53              PLLCFG_PLLDIGDIV_SYS(52)                  /*!< PLLDIG clock divided by 53 for system clock */
#define RCU_PLLDIG_SYS_DIV54              PLLCFG_PLLDIGDIV_SYS(53)                  /*!< PLLDIG clock divided by 54 for system clock */
#define RCU_PLLDIG_SYS_DIV55              PLLCFG_PLLDIGDIV_SYS(54)                  /*!< PLLDIG clock divided by 55 for system clock */
#define RCU_PLLDIG_SYS_DIV56              PLLCFG_PLLDIGDIV_SYS(55)                  /*!< PLLDIG clock divided by 56 for system clock */
#define RCU_PLLDIG_SYS_DIV57              PLLCFG_PLLDIGDIV_SYS(56)                  /*!< PLLDIG clock divided by 57 for system clock */
#define RCU_PLLDIG_SYS_DIV58              PLLCFG_PLLDIGDIV_SYS(57)                  /*!< PLLDIG clock divided by 58 for system clock */
#define RCU_PLLDIG_SYS_DIV59              PLLCFG_PLLDIGDIV_SYS(58)                  /*!< PLLDIG clock divided by 59 for system clock */
#define RCU_PLLDIG_SYS_DIV60              PLLCFG_PLLDIGDIV_SYS(59)                  /*!< PLLDIG clock divided by 60 for system clock */
#define RCU_PLLDIG_SYS_DIV61              PLLCFG_PLLDIGDIV_SYS(60)                  /*!< PLLDIG clock divided by 61 for system clock */
#define RCU_PLLDIG_SYS_DIV62              PLLCFG_PLLDIGDIV_SYS(61)                  /*!< PLLDIG clock divided by 62 for system clock */
#define RCU_PLLDIG_SYS_DIV63              PLLCFG_PLLDIGDIV_SYS(62)                  /*!< PLLDIG clock divided by 63 for system clock */
#define RCU_PLLDIG_SYS_DIV64              PLLCFG_PLLDIGDIV_SYS(63)                  /*!< PLLDIG clock divided by 64 for system clock */
#endif /* GD32W515 */

